* Summary Results
  To say the wireless data is noisy is an understatement.  Taking an
  average, however, is revealing - ~70 ms for QFQ vs ~110ms for
  PFIFO_FAST. Something like TiQ is needed on top of this to make
  wireless behave better.

  I also started running tests for 1000 seconds, to compensate for
  weirdnesses that can happen with minstrel changing rates. Doing that ends up locking up the driver.

  Also, iperf will not succeed in making more than 30+ connections on
  a regular basis, which is interesting. So I scaled back to 10
  connects for now.

  FIXME: I need to come up with a better plotting mechanism for wireless.

** Latency under load Test, QFQ vs PFIFO_FAST (wireless)
** Configurations
*** LAPTOP
| PROG       |        COUNT | DETAILS                  |
| IPERF      |           10 | -t 50 -w256k             |
| FPING      |            2 | -q -c 60                 |
| TXQUEUELEN |         1000 |                          |
| TSO        |          OFF |                          |
| GSO        |          OFF |                          |
| BQL        |         4500 |                          |
| TX_RING    |           64 |                          |
| SPEED      |          100 |                          |
| QDISCS     | The variable | PFIFO_FAST,STA_QFQ       |
| KERNEL     |        3.1.5 | bql-8                    |
*** CEROWRT

| PROG       |      COUNT | DETAILS                                       |
| IPERF      |         10 | -s -w256k                                     |
| FPING      |          2 |                                               |
| TXQUEUELEN |        100 |                                               |
| TSO        |        OFF |                                               |
| GSO        |        OFF |                                               |
| BQL        | Not needed |                                               |
| SPEED      |        100 | Wireless 5.x ghz                              |
| TX_RING    |          4 |                                               |
| QDISCS     |        512 | STA-QFQ script (QFQ, 512 bins, pfifo limit 24 |
| KERNEL     |      3.1.5 | bql-8                                         |

*** GENERAL NOTES
I note that the buffer size on QFQ is set to 24 pfifo per bin.

SFQ has a hard limit of 127 packets. This may or may not account for the difference in plots
** Results (normal scale)
#+PLOT: ind:1 type:2d title:"Wireless-n Latency under Load - PFIFO vs QFQ - vs 10 iperfs" set:"ylabel 'RTT MS'" set:"yrange [1:200]" set:"key on inside center box title 'PING RTT'" set:"timestamp bottom" 
|    T |     QFQ 1 |     QFQ 2 |   PFIFO 1 |   PFIFO 2 |
|------+-----------+-----------+-----------+-----------|
|    1 |      1.13 |      2.47 |      1.14 |      2.46 |
|    2 |      2.38 |      2.38 |      2.46 |      2.46 |
|    3 |      3.75 |      2.50 |      2.43 |      2.49 |
|    4 |     27.68 |     26.14 |      2.55 |      2.51 |
|    5 |     77.68 |     62.38 |      2.53 |      2.46 |
|    6 |     30.83 |     26.75 |     61.34 |     64.31 |
|    7 |     95.93 |     54.84 |    118.42 |    197.33 |
|    8 |     57.97 |     79.92 |    135.99 |    223.37 |
|    9 |     98.41 |     64.69 |    187.39 |    147.08 |
|   10 |     92.30 |     54.93 |     49.57 |     80.81 |
|   11 |     58.67 |     74.35 |    126.75 |     89.64 |
|   12 |     61.05 |     25.86 |    153.85 |    113.38 |
|   13 |    103.36 |     93.64 |    128.43 |    195.92 |
|   14 |    105.32 |     65.02 |    155.59 |    175.46 |
|   15 |     88.70 |     97.70 |    112.93 |    198.76 |
|   16 |     49.35 |     48.15 |     91.91 |     61.24 |
|   17 |     66.52 |     54.53 |     93.37 |    161.52 |
|   18 |     83.52 |     46.26 |    190.70 |    150.36 |
|   19 |     82.83 |     74.97 |     14.69 |    188.81 |
|   20 |     87.45 |     95.89 |     96.15 |     61.02 |
|   21 |     33.00 |     81.85 |    135.76 |    113.57 |
|   22 |     76.18 |     87.49 |    240.57 |    200.55 |
|   23 |     50.01 |     57.22 |    127.55 |    153.93 |
|   24 |     86.47 |     49.71 |    162.06 |    121.63 |
|   25 |     58.01 |     37.32 |     81.86 |     41.90 |
|   26 |     70.23 |     80.03 |    168.10 |    175.25 |
|   27 |     75.00 |     82.69 |    122.59 |     93.77 |
|   28 |    105.00 |     64.70 |    132.35 |     86.50 |
|   29 |     93.22 |     73.84 |    127.86 |     89.25 |
|   30 |     40.54 |     48.11 |    173.40 |    164.10 |
|   31 |     19.13 |     95.70 |     64.78 |    148.96 |
|   32 |     83.44 |     49.36 |    182.91 |    132.49 |
|   33 |     52.56 |     65.52 |    200.37 |    152.28 |
|   34 |     25.93 |     74.24 |     77.72 |     45.37 |
|   35 |     73.08 |     52.38 |     80.58 |     93.88 |
|   36 |     91.23 |     81.15 |    123.59 |    104.01 |
|   37 |     61.25 |     40.31 |    153.11 |    182.23 |
|   38 |     79.16 |     65.96 |    101.02 |     50.62 |
|   39 |     41.48 |    177.32 |     71.27 |     20.84 |
|   40 |     54.53 |    275.67 |    207.95 |    163.36 |
|   41 |    340.56 |    300.13 |     94.20 |     61.91 |
|   42 |    154.36 |    109.66 |    130.82 |    152.93 |
|   43 |    147.73 |    107.38 |    123.46 |     61.36 |
|   44 |    133.26 |    173.57 |     74.95 |     95.18 |
|   45 |    161.51 |    121.05 |     95.17 |    121.03 |
|   46 |     83.09 |     42.14 |    150.58 |    175.84 |
|   47 |     63.01 |     63.00 |     74.36 |    169.63 |
|   48 |     81.17 |     44.16 |     82.01 |     64.93 |
|   49 |     59.62 |     66.01 |    147.54 |     87.08 |
|   50 |     38.79 |     93.21 |    193.50 |    133.88 |
|   51 |     85.01 |     40.72 |    168.42 |    144.86 |
|   52 |     63.16 |     75.47 |    164.75 |    202.50 |
|   53 |     79.89 |     54.55 |    134.02 |    133.90 |
|   54 |     97.34 |     46.80 |    132.58 |    143.38 |
|   55 |      2.06 |      2.48 |    167.04 |    106.53 |
|   56 |      2.58 |      2.55 |    109.25 |    127.78 |
|   57 |      2.58 |      2.55 |     53.96 |     33.80 |
|   58 |      2.48 |      2.54 |      2.49 |      2.52 |
|   59 |      2.54 |      2.56 |      2.52 |      2.44 |
|   60 |      2.54 |      2.53 |      2.50 |      2.48 |
|------+-----------+-----------+-----------+-----------|
| mean | 80.892549 | 78.910588 | 127.35549 | 126.00431 |
#+TBLFM: @62$2=vmean(@5$2..@55$2)::@62$3=vmean(@5$3..@55$3)::@62$4=vmean(@7$4..@57$4)::@62$5=vmean(@7$5..@57$5)


** Results (log scale)
#+PLOT: ind:1 col:(2 4) type:2d title:"Wireless-n Latency under Load - QFQ vs PFIFO_FAST - vs 10 iperfs LOG SCALE" set:"ylabel 'RTT MS'" set:"logscale y" set:"yrange [1:320]" set:"key on inside center box title 'PING RTT'" 
|  T | QFQ 1       | QFQ 2       | PFIFO 1     | PFIFO 2     |
|----+-------------+-------------+-------------+-------------|
|  1 |        1.13 |        2.47 |        1.14 |        2.46 |
|  2 |        2.38 |        2.38 |        2.46 |        2.46 |
|  3 |        3.75 |        2.50 |        2.43 |        2.49 |
|  4 |       27.68 |       26.14 |        2.55 |        2.51 |
|  5 |       77.68 |       62.38 |        2.53 |        2.46 |
|  6 |       30.83 |       26.75 |       61.34 |       64.31 |
|  7 |       95.93 |       54.84 |      118.42 |      197.33 |
|  8 |       57.97 |       79.92 |      135.99 |      223.37 |
|  9 |       98.41 |       64.69 |      187.39 |      147.08 |
| 10 |       92.30 |       54.93 |       49.57 |       80.81 |
| 11 |       58.67 |       74.35 |      126.75 |       89.64 |
| 12 |       61.05 |       25.86 |      153.85 |      113.38 |
| 13 |      103.36 |       93.64 |      128.43 |      195.92 |
| 14 |      105.32 |       65.02 |      155.59 |      175.46 |
| 15 |       88.70 |       97.70 |      112.93 |      198.76 |
| 16 |       49.35 |       48.15 |       91.91 |       61.24 |
| 17 |       66.52 |       54.53 |       93.37 |      161.52 |
| 18 |       83.52 |       46.26 |      190.70 |      150.36 |
| 19 |       82.83 |       74.97 |       14.69 |      188.81 |
| 20 |       87.45 |       95.89 |       96.15 |       61.02 |
| 21 |       33.00 |       81.85 |      135.76 |      113.57 |
| 22 |       76.18 |       87.49 |      240.57 |      200.55 |
| 23 |       50.01 |       57.22 |      127.55 |      153.93 |
| 24 |       86.47 |       49.71 |      162.06 |      121.63 |
| 25 |       58.01 |       37.32 |       81.86 |       41.90 |
| 26 |       70.23 |       80.03 |      168.10 |      175.25 |
| 27 |       75.00 |       82.69 |      122.59 |       93.77 |
| 28 |      105.00 |       64.70 |      132.35 |       86.50 |
| 29 |       93.22 |       73.84 |      127.86 |       89.25 |
| 30 |       40.54 |       48.11 |      173.40 |      164.10 |
| 31 |       19.13 |       95.70 |       64.78 |      148.96 |
| 32 |       83.44 |       49.36 |      182.91 |      132.49 |
| 33 |       52.56 |       65.52 |      200.37 |      152.28 |
| 34 |       25.93 |       74.24 |       77.72 |       45.37 |
| 35 |       73.08 |       52.38 |       80.58 |       93.88 |
| 36 |       91.23 |       81.15 |      123.59 |      104.01 |
| 37 |       61.25 |       40.31 |      153.11 |      182.23 |
| 38 |       79.16 |       65.96 |      101.02 |       50.62 |
| 39 |       41.48 |      177.32 |       71.27 |       20.84 |
| 40 |       54.53 |      275.67 |      207.95 |      163.36 |
| 41 |      340.56 |      300.13 |       94.20 |       61.91 |
| 42 |      154.36 |      109.66 |      130.82 |      152.93 |
| 43 |      147.73 |      107.38 |      123.46 |       61.36 |
| 44 |      133.26 |      173.57 |       74.95 |       95.18 |
| 45 |      161.51 |      121.05 |       95.17 |      121.03 |
| 46 |       83.09 |       42.14 |      150.58 |      175.84 |
| 47 |       63.01 |       63.00 |       74.36 |      169.63 |
| 48 |       81.17 |       44.16 |       82.01 |       64.93 |
| 49 |       59.62 |       66.01 |      147.54 |       87.08 |
| 50 |       38.79 |       93.21 |      193.50 |      133.88 |
| 51 |       85.01 |       40.72 |      168.42 |      144.86 |
| 52 |       63.16 |       75.47 |      164.75 |      202.50 |
| 53 |       79.89 |       54.55 |      134.02 |      133.90 |
| 54 |       97.34 |       46.80 |      132.58 |      143.38 |
| 55 |        2.06 |        2.48 |      167.04 |      106.53 |
| 56 |        2.58 |        2.55 |      109.25 |      127.78 |
| 57 |        2.58 |        2.55 |       53.96 |       33.80 |
| 58 |        2.48 |        2.54 |        2.49 |        2.52 |
| 59 |        2.54 |        2.56 |        2.52 |        2.44 |
| 60 |        2.54 |        2.53 |        2.50 |        2.48 |
